{
  "backend/main.mo": "Motoko backend actor managing rooms, messages, moderation actions, reports, and user profiles with access control and message retention.",
  "feature_evidence.json": "Feature evidence report describing a no-change rebuild and redeploy, listing affected frontend files and components.",
  "frontend-file-summaries.txt": "Prewritten summaries for numerous frontend files including pages, hooks, components, and utilities.",
  "frontend/index.css": "Tailwind base and theme variables defining light/dark color tokens and global styles.",
  "frontend/index.html": "Basic HTML shell loading the React app entry point.",
  "frontend/src/App.tsx": "Main React app defining routes for rooms, chat, settings, and login using TanStack Router, wrapped in ThemeProvider.",
  "frontend/src/components/chat/MessageActionsMenu.tsx": "Dropdown menu component providing mute, block, and report actions with a dialog for submitting reports.",
  "frontend/src/components/chat/MessageComposer.tsx": "Message composer handling authentication, profile readiness, message validation, and sending with error states.",
  "frontend/src/components/chat/MessageList.tsx": "Renders a scrollable chat message list with auto-scroll, moderation filtering, timestamp formatting, and per-message actions.",
  "frontend/src/components/layout/AppShell.tsx": "Provides the main application layout with header, area display, routed content, and bottom navigation.",
  "frontend/src/data/indiaStateCentroids.ts": "Exports approximate latitude/longitude centroids for Indian states and union territories for closest-state calculations.",
  "frontend/src/data/indiaStates.ts": "Defines stable IDs and display labels for all Indian states and union territories.",
  "frontend/src/hooks/useActor.ts": "Creates and manages an authenticated or anonymous backend actor, recreating it on identity changes and invalidating dependent queries.",
  "frontend/src/hooks/useAnonProfile.ts": "Loads or generates a persistent anonymous profile and provides an updater for storing changes.",
  "frontend/src/hooks/useAreaSelection.ts": "Manages selected area state, persists updates, and can auto-select the closest Indian state using geolocation.",
  "frontend/src/hooks/useAuthControls.ts": "Wraps Internet Identity to provide login/logout helpers, status flags, and cache-clearing on logout.",
  "frontend/src/hooks/useInternetIdentity.ts": "Implements a context provider and hook for managing Dfinity Internet Identity authentication and state persistence.",
  "frontend/src/hooks/useModeration.ts": "Stores muted/blocked users in localStorage and filters messages while providing mute/unmute and block/unblock utilities.",
  "frontend/src/hooks/useQueries.ts": "Provides React Query hooks for rooms, messages, and user actions, wrapping backend actor calls with caching and polling support.",
  "frontend/src/hooks/useUserProfile.ts": "Manages unified user profiles, loading from backend when authenticated or local storage when anonymous, with auto-creation and update logic.",
  "frontend/src/index.css": "Defines Tailwind base styles, theme variables, dark mode values, and a subtle background image overlay.",
  "frontend/src/main.tsx": "Bootstraps the React app with React Query and Internet Identity providers.",
  "frontend/src/pages/ChatPage.tsx": "Displays a chat room view with messages, header controls, and a composer using live-polling message queries.",
  "frontend/src/pages/LoginPage.tsx": "Renders the login UI with Internet Identity flow, handling redirects and login errors.",
  "frontend/src/pages/RoomsPage.tsx": "Shows rooms filtered by location, supports search and authenticated room creation, and handles navigation to chat rooms.",
  "frontend/src/pages/SettingsPage.tsx": "Renders the settings UI, handling location access, area selection, nickname updates, profile creation, and login/logout actions.",
  "frontend/src/storage/anonProfileStorage.ts": "Manages anonymous profile generation and persistence in localStorage, including random IDs, nicknames, colors, and avatars.",
  "frontend/src/storage/areaSelectionStorage.ts": "Loads and saves the user's area selection to localStorage and defines available areas including an 'All areas' option.",
  "frontend/src/utils/auth/isAuthError.ts": "Detects authentication-related backend errors by matching message patterns.",
  "frontend/src/utils/auth/postLoginRedirect.ts": "Stores, retrieves, and clears a post‑login redirect path in sessionStorage.",
  "frontend/src/utils/location/closestIndianState.ts": "Computes the closest Indian state to given coordinates using the Haversine distance formula.",
  "frontend/src/utils/urlParams.ts": "Provides utilities for reading URL parameters, persisting them in sessionStorage, and managing hash query parameters.",
  "frontend/tailwind.config.js": "Configures TailwindCSS theme, colors, animations, plugins, and content scanning.",
  "project_state.json": "Defines the project state metadata, issue list, and notes that this is a production rebuild request with no functional changes."
}