{
  "backend/main.mo": "Main actor implementing rooms, messages, profiles, moderation, and access control with password-protected room creation and message retention.",
  "backend/migration.mo": "Migration module copying old room state and initializing new roomPasswords map.",
  "feature_evidence.json": "Feature evidence report mapping feature requirements to affected frontend files and components.",
  "frontend-file-summaries.txt": "Generated summaries of many frontend source files describing their purpose and behavior.",
  "frontend/index.css": "Tailwind base and theme variable definitions for light and dark mode styling.",
  "frontend/index.html": "Basic HTML shell loading the React app entrypoint.",
  "frontend/src/App.tsx": "Main React router setup and app shell initialization with theme and global providers.",
  "frontend/src/components/admin/AdminModerationPanels.tsx": "Admin UI for managing rooms, messages, and user bans with password-based room deletion dialog.",
  "frontend/src/components/admin/AdminPasswordAccessPrompt.tsx": "Password prompt component for unlocking admin access via a form.",
  "frontend/src/components/chat/InRoomAdminControls.tsx": "Shows admin-only room controls like locking and deleting a room when admin access is unlocked.",
  "frontend/src/components/chat/MessageActionsMenu.tsx": "Provides per-message actions including mute, block, report, and admin delete with supporting dialogs and mutations.",
  "frontend/src/components/chat/MessageComposer.tsx": "Handles composing and sending messages with auth checks, profile readiness, length limits, and login prompts.",
  "frontend/src/components/chat/MessageList.tsx": "Renders and auto-scrolls a filtered list of messages with avatars, timestamps, and action menus.",
  "frontend/src/components/layout/AppShell.tsx": "Defines the main layout with header, content area, and bottom navigation reflecting the current route.",
  "frontend/src/components/rooms/RoomActionsMenu.tsx": "Dropdown menu for room-level actions, currently supporting password-protected room deletion.",
  "frontend/src/components/rooms/RoomDeleteWithPasswordDialog.tsx": "Dialog that prompts for a room password and triggers room deletion with feedback and optional success callback.",
  "frontend/src/data/indiaStateCentroids.ts": "Exports approximate centroid coordinates for Indian states and union territories for in-memory location calculations.",
  "frontend/src/data/indiaStates.ts": "Defines an IndiaState interface and exports a list of all Indian states and union territories with stable IDs.",
  "frontend/src/hooks/useActor.ts": "Creates and caches an authenticated or anonymous backend actor and refreshes dependent queries when identity changes.",
  "frontend/src/hooks/useAdminAccess.ts": "Manages a simple password-based admin unlock state stored in sessionStorage with cross-component sync via events.",
  "frontend/src/hooks/useAdminManagement.ts": "Combines UI admin unlock state with backend admin checks to determine if the user can perform admin operations.",
  "frontend/src/hooks/useAnonProfile.ts": "Loads or generates a local anonymous profile and provides an update helper that persists changes.",
  "frontend/src/hooks/useAreaSelection.ts": "Manages area selection with optional geolocation to auto-select the nearest Indian state and persists the choice.",
  "frontend/src/hooks/useAuthControls.ts": "Wraps Internet Identity auth with helpers for safe login, logout, and computed auth state.",
  "frontend/src/hooks/useInternetIdentity.ts": "Provides context and helpers for managing Internet Identity login, stored identities, and AuthClient lifecycle.",
  "frontend/src/hooks/useModeration.ts": "Handles local mute/block lists stored in localStorage and filters messages accordingly.",
  "frontend/src/hooks/useQueries.ts": "Defines React Query hooks for rooms, messages, and mutations using the backend actor with cache invalidation logic.",
  "frontend/src/hooks/useUserProfile.ts": "Provides a unified user profile hook combining authenticated backend profiles and anonymous local profiles, with auto-creation and update logic.",
  "frontend/src/index.css": "Defines Tailwind base styles, theme variables for light/dark modes, and background styling for the app.",
  "frontend/src/main.tsx": "Bootstraps the React app, wrapping it with React Query and Internet Identity providers.",
  "frontend/src/pages/AdminPage.tsx": "Renders the admin panel with password gating, access checks, and moderation tools.",
  "frontend/src/pages/ChatPage.tsx": "Displays a room chat interface with messages, composer, and in-room admin controls.",
  "frontend/src/pages/LoginPage.tsx": "Implements login UI using Internet Identity with redirect handling and error display.",
  "frontend/src/pages/RoomsPage.tsx": "Shows rooms filtered by location, enables room creation with auth checks, and supports room search.",
  "frontend/src/pages/SettingsPage.tsx": "Provides user settings including area selection, profile editing, auth controls, location access, and admin access management.",
  "frontend/src/storage/anonProfileStorage.ts": "Generates, saves, and loads anonymous user profiles with random IDs, nicknames, colors, and avatars in localStorage.",
  "frontend/src/storage/areaSelectionStorage.ts": "Loads and saves selected geographic areas in localStorage and provides a list of all areas including Indian states.",
  "frontend/src/utils/auth/isAuthError.ts": "Detects auth-related errors, extracts safe error messages, and adds guidance when an error indicates authentication issues.",
  "frontend/src/utils/auth/postLoginRedirect.ts": "Stores, retrieves, and clears a post-login redirect path using sessionStorage.",
  "frontend/src/utils/location/closestIndianState.ts": "Computes the nearest Indian state to given coordinates using Haversine distance and state centroids.",
  "frontend/src/utils/urlParams.ts": "Provides utilities for reading URL parameters, persisting them in sessionStorage, and cleaning parameters from the URL.",
  "frontend/src/utils/validation/principalText.ts": "Validates user-provided Principal text and returns either a parsed Principal or an error message.",
  "frontend/tailwind.config.js": "Configures Tailwind CSS theme, plugins, colors, animations, and content paths for the frontend.",
  "project_state.json": "Describes project state and requirements for implementing password-based room deletion instead of identity-based authorization."
}