{
  "backend/main.mo": "Main backend actor implementing rooms, messages, moderation (mute/block/ban), reports, and user profiles with admin‑gated actions and storage maps.",
  "backend/migration.mo": "Migration module converting old message format to include senderPrincipal and initializing bannedUsers while preserving other actor state.",
  "feature_evidence.json": "Feature evidence report mapping admin UI and React Query moderation features to corresponding frontend files and components.",
  "frontend-file-summaries.txt": "Pre-written summaries describing purposes of all frontend source files, hooks, components, and pages.",
  "frontend/index.css": "Global Tailwind-based style definitions including custom OKLCH color tokens for light and dark themes.",
  "frontend/index.html": "Base HTML entry point loading the React application via main.tsx.",
  "frontend/src/App.tsx": "Root router configuration and app layout initialization using TanStack Router, ThemeProvider, and global toast provider.",
  "frontend/src/components/chat/MessageActionsMenu.tsx": "Per-message actions menu providing moderation tools, including admin‑gated delete/ban/unban actions and user mute/block/report flows.",
  "frontend/src/components/chat/MessageComposer.tsx": "A chat input component handling authentication, profile readiness, validation, and message sending with error states and UI prompts.",
  "frontend/src/components/chat/MessageList.tsx": "Renders a scrollable, moderated chat message list with avatars, timestamps, and action menus, autoscrolling on updates.",
  "frontend/src/components/layout/AppShell.tsx": "Defines the main app layout with header, content area, and bottom navigation tied to router state and area selection.",
  "frontend/src/data/indiaStateCentroids.ts": "Provides approximate latitude/longitude centroids for Indian states and union territories used for closest-state calculations.",
  "frontend/src/data/indiaStates.ts": "Exports stable IDs and labels for all Indian states and union territories.",
  "frontend/src/hooks/useActor.ts": "Creates and caches a backend actor based on Internet Identity, reinitializing and invalidating queries when identity changes.",
  "frontend/src/hooks/useAnonProfile.ts": "Loads or generates a local anonymous profile and provides an updater that persists changes.",
  "frontend/src/hooks/useAreaSelection.ts": "Manages stored area selection and geolocation-based auto-selection of the nearest Indian state.",
  "frontend/src/hooks/useAuthControls.ts": "Wraps Internet Identity auth to provide login/logout helpers, auth state, and query cache clearing on logout.",
  "frontend/src/hooks/useInternetIdentity.ts": "Provides React context and hooks for Internet Identity authentication, managing login state and loading persisted identities.",
  "frontend/src/hooks/useModeration.ts": "Manages muted and blocked users with localStorage persistence and filters messages accordingly.",
  "frontend/src/hooks/useQueries.ts": "Defines React Query hooks for rooms, messages, and user actions such as creating rooms, sending messages, and moderation.",
  "frontend/src/hooks/useUserProfile.ts": "Unifies backend and anonymous user profiles, syncing authenticated profiles via React Query with auto‑creation logic.",
  "frontend/src/index.css": "Sets Tailwind base styles and custom CSS variables for light/dark themes and background styling.",
  "frontend/src/main.tsx": "Bootstraps the React app with QueryClient and InternetIdentity providers.",
  "frontend/src/pages/ChatPage.tsx": "Implements the chat page UI, displaying messages with polling, message composer, and admin room‑deletion controls.",
  "frontend/src/pages/LoginPage.tsx": "Displays a login screen with Google or Internet Identity sign-in and redirects after authentication.",
  "frontend/src/pages/RoomsPage.tsx": "Shows rooms filtered by area and search, and handles creating or joining rooms with auth and area checks.",
  "frontend/src/pages/SettingsPage.tsx": "Manages user settings including area selection, location access, profile updates, and login/logout actions.",
  "frontend/src/storage/anonProfileStorage.ts": "Generates, loads, and saves anonymous user profiles with random IDs, nicknames, colors, and avatars.",
  "frontend/src/storage/areaSelectionStorage.ts": "Stores and retrieves area-selection settings and exposes a list of all areas including a special 'All areas' option.",
  "frontend/src/utils/auth/isAuthError.ts": "Detects authentication-related backend errors by matching common message patterns.",
  "frontend/src/utils/auth/postLoginRedirect.ts": "Stores and retrieves a post-login redirect path using sessionStorage.",
  "frontend/src/utils/location/closestIndianState.ts": "Computes the nearest Indian state to given coordinates using the Haversine distance algorithm.",
  "frontend/src/utils/urlParams.ts": "Provides helpers to read, persist, and clear URL parameters from query strings, hash routes, and sessionStorage.",
  "frontend/tailwind.config.js": "Tailwind CSS config enabling dark mode, custom colors, fonts, animations, and plugins for typography, container queries, and animations.",
  "project_state.json": "Project state describing moderation feature requirements, existing issues, and admin permission model tied to Internet Identity."
}