{
  "backend/main.mo": "Main backend canister implementing rooms, messages, moderation, profiles, bans, and access control with Map/List storage and permission checks.",
  "feature_evidence.json": "Defines feature evidence records listing related files, components, test IDs, and confidence for build‑fix and diagnostic‑note features.",
  "frontend-file-summaries.txt": "Contains prewritten summaries of many frontend files for reference or documentation purposes.",
  "frontend/DEPLOY_DIAGNOSTICS.md": "Explains the TypeScript build failure caused by missing React type imports and documents the fix applied for successful deployment.",
  "frontend/index.css": "Tailwind CSS base/theme definitions with light and dark OKLCH color tokens and global background/foreground styles.",
  "frontend/index.html": "Minimal HTML entry point loading the React app via main.tsx.",
  "frontend/src/App.tsx": "Sets up TanStack Router routes and wraps the UI with AppShell, ThemeProvider, and Toaster.",
  "frontend/src/components/admin/AdminModerationPanels.tsx": "Admin dashboard panels for room deletion, message moderation, and user banning gated by admin capability.",
  "frontend/src/components/admin/AdminPasswordAccessPrompt.tsx": "UI component prompting for the admin password to unlock admin controls with validation and error display.",
  "frontend/src/components/chat/InRoomAdminControls.tsx": "Empty or placeholder file with no implemented content.",
  "frontend/src/components/chat/MessageActionsMenu.tsx": "UI menu for message actions like mute, block, report, and admin delete, backed by mutations and dialogs.",
  "frontend/src/components/chat/MessageComposer.tsx": "Message input box handling auth, profile readiness, length checks, and message sending with keyboard shortcuts.",
  "frontend/src/components/chat/MessageList.tsx": "Displays chat messages with auto‑scroll, moderation filtering, timestamps, and per‑message action menus.",
  "frontend/src/components/layout/AppShell.tsx": "App layout providing header, main content area, and bottom navigation with area selection display.",
  "frontend/src/components/rooms/RoomActionsMenu.tsx": "Empty placeholder file for room‑related actions menu.",
  "frontend/src/components/rooms/RoomDeleteWithPasswordDialog.tsx": "Dialog for deleting a room requiring the admin password and calling the backend delete mutation.",
  "frontend/src/config/adminPassword.ts": "Exports the shared UI admin password constant used for unlocking admin controls.",
  "frontend/src/data/indiaStateCentroids.ts": "Provides approximate latitude/longitude centroids for Indian states and union territories.",
  "frontend/src/data/indiaStates.ts": "List of Indian states and union territories with stable IDs and display labels.",
  "frontend/src/hooks/useActor.ts": "Creates and manages a backend actor based on identity, reinitializing and invalidating queries when identity changes.",
  "frontend/src/hooks/useAdminAccess.ts": "Manages UI admin unlock state with password validation and sessionStorage persistence.",
  "frontend/src/hooks/useAdminManagement.ts": "Combines UI unlock state and backend admin checks to determine if admin actions are allowed.",
  "frontend/src/hooks/useAnonProfile.ts": "Loads or generates a local anonymous profile and provides an update helper.",
  "frontend/src/hooks/useAreaSelection.ts": "Handles area selection persistence and optional geolocation-based auto-selection of nearest state.",
  "frontend/src/hooks/useAuthControls.ts": "Wraps Internet Identity login/logout with safe login logic and query cache clearing.",
  "frontend/src/hooks/useInternetIdentity.ts": "Provides Internet Identity context, handling identity loading, login, logout, and status tracking.",
  "frontend/src/hooks/useModeration.ts": "Stores muted/blocked users locally and filters messages based on moderation settings.",
  "frontend/src/hooks/useQueries.ts": "Provides React Query hooks for rooms, messages, and mutations using the backend actor.",
  "frontend/src/hooks/useUserProfile.ts": "Provides a unified user profile hook that loads, creates, and updates either backend or anonymous profiles depending on authentication state.",
  "frontend/src/index.css": "Defines Tailwind base layers and custom CSS variables for light/dark themes, plus background styling and utility classes.",
  "frontend/src/main.tsx": "Bootstraps the React app, wrapping it with React Query and Internet Identity providers.",
  "frontend/src/pages/AdminPage.tsx": "Renders the admin interface with password gating, capability checks, and moderation panels.",
  "frontend/src/pages/ChatPage.tsx": "Displays room chat messages with a header, message list, and composer, loading messages by room ID.",
  "frontend/src/pages/LoginPage.tsx": "Provides login UI using Internet Identity, handling redirects and showing authentication errors.",
  "frontend/src/pages/RoomsPage.tsx": "Lists rooms by location, supports search and room creation, and handles auth and area-selection constraints.",
  "frontend/src/pages/SettingsPage.tsx": "Offers settings for location, profile, authentication, and admin access, including profile edits and area selection.",
  "frontend/src/storage/anonProfileStorage.ts": "Generates, loads, and saves anonymous user profiles with random IDs, nicknames, colors, and avatars in localStorage.",
  "frontend/src/storage/areaSelectionStorage.ts": "Provides load/save helpers for selected areas in localStorage and defines available areas including all Indian states.",
  "frontend/src/utils/auth/isAuthError.ts": "Detects authentication-related errors, extracts safe user-facing messages, and adds guidance when login is required.",
  "frontend/src/utils/auth/postLoginRedirect.ts": "Stores, retrieves, and clears post-login redirect paths using sessionStorage.",
  "frontend/src/utils/location/closestIndianState.ts": "Computes the nearest Indian state to given coordinates using the Haversine formula and predefined centroids.",
  "frontend/src/utils/urlParams.ts": "Utilities for reading, persisting, and clearing URL parameters using URL parsing and sessionStorage.",
  "frontend/src/utils/validation/principalText.ts": "Validates text input as a Dfinity Principal and returns either the parsed Principal or an error message.",
  "frontend/tailwind.config.js": "Tailwind configuration extending colors, fonts, animations, and plugins for the project's styling system.",
  "project_state.json": "Project state metadata tracking build-failure fixes, requirements, and known issues."
}