{
  "backend/main.mo": "Main canister logic handling rooms, messages, moderation actions, user profiles, bans, and access control with counters and retention limits.",
  "backend/migration.mo": "Defines old/new state types and a simple migration function that returns the old actor state unchanged.",
  "feature_evidence.json": "Feature evidence listing frontend files, components, and test IDs associated with admin password alignment and admin‑capability UX changes.",
  "frontend-file-summaries.txt": "Prewritten summaries of numerous frontend files describing hooks, pages, components, and utilities used throughout the app.",
  "frontend/index.css": "Global Tailwind base layer defining OKLCH color tokens, theme variables, and light/dark mode styling.",
  "frontend/index.html": "Basic HTML entry point mounting the React app and loading main.tsx.",
  "frontend/src/App.tsx": "Sets up TanStack Router routes, initializes profile and area hooks, and wraps the app with ThemeProvider and Toaster.",
  "frontend/src/components/admin/AdminModerationPanels.tsx": "Admin panels for room deletion, message deletion, and user banning, gated by admin capability and using related backend mutations.",
  "frontend/src/components/admin/AdminPasswordAccessPrompt.tsx": "UI component that prompts for an admin password and triggers an unlock callback, showing errors and handling submission state.",
  "frontend/src/components/chat/InRoomAdminControls.tsx": "Empty placeholder file for in-room admin controls.",
  "frontend/src/components/chat/MessageActionsMenu.tsx": "Provides a dropdown menu for message-level actions like mute, block, report, and admin delete, including dialogs and backend mutations.",
  "frontend/src/components/chat/MessageComposer.tsx": "Handles composing and sending chat messages with auth/profile checks, error handling, and login prompts.",
  "frontend/src/components/chat/MessageList.tsx": "Renders a scrollable list of chat messages with moderation filtering and per-message action menus.",
  "frontend/src/components/layout/AppShell.tsx": "Defines the main application layout with header, content area, and bottom navigation tied to router state.",
  "frontend/src/components/rooms/RoomActionsMenu.tsx": "Empty placeholder file for room-level actions menu.",
  "frontend/src/components/rooms/RoomDeleteWithPasswordDialog.tsx": "Dialog for deleting a room that validates an admin password and triggers a backend delete mutation.",
  "frontend/src/config/adminPassword.ts": "Exports the shared UI admin password used for unlocking admin controls.",
  "frontend/src/data/indiaStateCentroids.ts": "Provides centroid coordinates for Indian states and union territories for in-memory geographic calculations.",
  "frontend/src/data/indiaStates.ts": "Defines an interface and a constant list of all Indian states and union territories with stable IDs and labels.",
  "frontend/src/hooks/useActor.ts": "No summary available.",
  "frontend/src/hooks/useAdminAccess.ts": "No summary available.",
  "frontend/src/hooks/useAdminManagement.ts": "No summary available.",
  "frontend/src/hooks/useAnonProfile.ts": "No summary available.",
  "frontend/src/hooks/useAreaSelection.ts": "No summary available.",
  "frontend/src/hooks/useAuthControls.ts": "No summary available.",
  "frontend/src/hooks/useInternetIdentity.ts": "No summary available.",
  "frontend/src/hooks/useModeration.ts": "No summary available.",
  "frontend/src/hooks/useQueries.ts": "No summary available.",
  "frontend/src/hooks/useUserProfile.ts": "Manages authenticated and anonymous user profiles, including fetching, auto-creating, and updating backend profiles.",
  "frontend/src/index.css": "Defines Tailwind base styles and theme variables for light and dark modes, plus global background styling.",
  "frontend/src/main.tsx": "Initializes React app with React Query and Internet Identity providers and renders the root component.",
  "frontend/src/pages/AdminPage.tsx": "Handles admin access flow with password unlock and displays moderation tools and capability status.",
  "frontend/src/pages/ChatPage.tsx": "Loads and displays room messages with a header and composer, handling navigation and loading states.",
  "frontend/src/pages/LoginPage.tsx": "Provides login UI and redirects after authentication, handling loading and error states.",
  "frontend/src/pages/RoomsPage.tsx": "Shows rooms filtered by area and search, and manages room creation with authentication and validation checks.",
  "frontend/src/pages/SettingsPage.tsx": "Provides settings for area selection, location access, profile editing, auth controls, and admin unlock.",
  "frontend/src/storage/anonProfileStorage.ts": "Generates, loads, and saves anonymous user profiles with random IDs, nicknames, colors, and avatars in localStorage.",
  "frontend/src/storage/areaSelectionStorage.ts": "Loads and saves selected geographic area info in localStorage and exposes a list of all areas including Indian states.",
  "frontend/src/utils/auth/isAuthError.ts": "Detects auth-related errors, extracts user-friendly messages, and appends login guidance when appropriate.",
  "frontend/src/utils/auth/postLoginRedirect.ts": "Stores, retrieves, and clears post-login redirect paths using sessionStorage.",
  "frontend/src/utils/location/closestIndianState.ts": "Computes the nearest Indian state to given coordinates using Haversine distance and predefined centroids.",
  "frontend/src/utils/urlParams.ts": "Provides helpers to read URL parameters, persist them in sessionStorage, and manage hash/query parameter cleanup.",
  "frontend/src/utils/validation/principalText.ts": "Validates and parses Principal IDs from user text input, returning structured success or error results.",
  "frontend/tailwind.config.js": "Configures TailwindCSS theme extensions, colors, animations, and plugins including typography and container queries.",
  "project_state.json": "Describes project metadata, current feature state, and requirements related to password-based admin privileges."
}