{
  "backend/main.mo": "Motoko backend canister managing rooms, messages, moderation (mute, block, report), and user profiles with counters and retention limits.",
  "backend/migration.mo": "Stub migration module exposing a run function that returns an empty new actor state.",
  "feature_evidence.json": "Feature evidence report linking a build-fix feature to affected frontend file and components.",
  "frontend-file-summaries.txt": "Prewritten summaries of numerous frontend files including hooks, pages, components, data modules, and utilities.",
  "frontend/index.css": "Global Tailwind base styles defining CSS variables for light and dark themes.",
  "frontend/index.html": "Basic HTML entry point mounting the React app and loading main.tsx.",
  "frontend/src/App.tsx": "Sets up TanStack Router routes and wraps the app with ThemeProvider, AppShell, and Toaster.",
  "frontend/src/components/admin/AdminPasswordAccessPrompt.tsx": "Empty placeholder file for an admin password prompt component.",
  "frontend/src/components/chat/MessageActionsMenu.tsx": "Dropdown menu for muting, blocking, and reporting messages with a report dialog and backend sync.",
  "frontend/src/components/chat/MessageComposer.tsx": "Message input box handling authentication, profile readiness, send validation, and backend message submission.",
  "frontend/src/components/chat/MessageList.tsx": "Renders a scrollable chat message list with auto-scroll, avatar display, timestamps, and moderation filtering.",
  "frontend/src/components/layout/AppShell.tsx": "Provides the main app layout including header, content area, and bottom navigation with area selection display.",
  "frontend/src/data/indiaStateCentroids.ts": "Exports approximate latitude/longitude centroids for Indian states and union territories for location-based state matching.",
  "frontend/src/data/indiaStates.ts": "Defines stable IDs and labels for all Indian states and union territories used for area selection.",
  "frontend/src/hooks/useActor.ts": "Creates and caches a backend actor tied to the current identity and refreshes dependent queries when the identity changes.",
  "frontend/src/hooks/useAdminAccess.ts": "Empty placeholder hook.",
  "frontend/src/hooks/useAdminManagement.ts": "Empty placeholder hook.",
  "frontend/src/hooks/useAnonProfile.ts": "Loads or generates a persistent anonymous profile and provides an update helper.",
  "frontend/src/hooks/useAreaSelection.ts": "Manages selected area, persists it, and provides geolocation-based closest-state auto-selection.",
  "frontend/src/hooks/useAuthControls.ts": "Wraps Internet Identity auth with helpers for safe login, logout, and cache clearing.",
  "frontend/src/hooks/useInternetIdentity.ts": "Implements Internet Identity context, loading, login, logout, and identity state management.",
  "frontend/src/hooks/useModeration.ts": "Handles local mute/block lists and filters messages accordingly, persisting state to localStorage.",
  "frontend/src/hooks/useQueries.ts": "Defines React Query hooks for fetching rooms, messages, and performing room/message mutations via the actor API.",
  "frontend/src/hooks/useUserProfile.ts": "Provides unified user profile management for authenticated and anonymous users, including backend loading, auto-creation, and updating.",
  "frontend/src/index.css": "Sets Tailwind CSS layers and theme variables for light/dark modes, plus global background and utility styles.",
  "frontend/src/main.tsx": "Bootstraps the React app with QueryClientProvider and InternetIdentityProvider.",
  "frontend/src/pages/AdminPage.tsx": "Empty placeholder for an admin page.",
  "frontend/src/pages/ChatPage.tsx": "Renders a chat interface showing messages for a room with polling and a message composer.",
  "frontend/src/pages/LoginPage.tsx": "Implements the login UI with Internet Identity-based authentication and redirects after login.",
  "frontend/src/pages/RoomsPage.tsx": "Displays rooms filtered by area, supports searching and creating rooms with authentication checks.",
  "frontend/src/pages/SettingsPage.tsx": "React settings page handling location access, area selection, profile updates, and login/logout actions using multiple hooks and UI components.",
  "frontend/src/storage/anonProfileStorage.ts": "Generates, loads, and saves anonymous user profiles with random IDs, nicknames, colors, and avatars in localStorage.",
  "frontend/src/storage/areaSelectionStorage.ts": "Manages persistence of area selection and location-enabled state, and exposes a list of available areas including all Indian states.",
  "frontend/src/utils/auth/isAuthError.ts": "Provides helpers to detect authentication-related errors and extract safe, truncated error messages.",
  "frontend/src/utils/auth/postLoginRedirect.ts": "Stores, retrieves, and clears post-login redirect paths using sessionStorage.",
  "frontend/src/utils/location/closestIndianState.ts": "Computes the nearest Indian state to given coordinates using Haversine distance and predefined centroids.",
  "frontend/src/utils/urlParams.ts": "Utilities for reading URL parameters, persisting them in sessionStorage, and clearing them from URL/hash.",
  "frontend/src/utils/validation/principalText.ts": "Validates and parses user-entered Principal IDs, returning either a parsed Principal or an error.",
  "frontend/tailwind.config.js": "Configures TailwindCSS theme, plugins, colors, fonts, animations, and content paths.",
  "project_state.json": "Stores project metadata, issues, and feature requests related to deployment fixes and removal of admin-role backend functionality."
}