{
  "backend/main.mo": "Motoko canister defining rooms, messages, user profiles, moderation actions, and access‑controlled methods for creating rooms, sending messages, and managing mutes/blocks/reports.",
  "feature_evidence.json": "Feature evidence report mapping three room‑search and messaging‑copy updates to affected frontend files and components with high confidence metadata.",
  "frontend-file-summaries.txt": "Prewritten summaries of various frontend files describing their responsibilities across routing, hooks, components, UI, and utilities.",
  "frontend/index.css": "Tailwind base styles defining theme variables for light and dark modes with custom color tokens and global background/text setup.",
  "frontend/index.html": "Basic HTML entry file loading the React app via main.tsx into a root div.",
  "frontend/src/App.tsx": "Main app entry configuring TanStack Router routes and wrapping pages with AppShell, ThemeProvider, and Toaster.",
  "frontend/src/components/chat/MessageActionsMenu.tsx": "UI menu for message actions including mute, block, and report, with a dialog for submitting report reasons and mutation handling.",
  "frontend/src/components/chat/MessageComposer.tsx": "Chat input component handling authentication, profile readiness, message sending, validation, and error states with login redirects.",
  "frontend/src/components/chat/MessageList.tsx": "Renders a scrollable message list with auto-scrolling, moderation filtering, sender avatars, timestamps, and message actions for non-own messages.",
  "frontend/src/components/layout/AppShell.tsx": "Provides the main layout with header, content area, and bottom navigation, showing current area selection and active route highlighting.",
  "frontend/src/data/indiaStateCentroids.ts": "Exports approximate latitude/longitude centroids for Indian states and union territories for in‑memory closest‑state calculations.",
  "frontend/src/data/indiaStates.ts": "Defines stable IDs and display labels for all Indian states and union territories.",
  "frontend/src/hooks/useActor.ts": "Creates and manages a backend actor based on Internet Identity, refreshing dependent queries when the actor changes.",
  "frontend/src/hooks/useAnonProfile.ts": "Loads or generates an anonymous user profile and provides an updater that persists changes.",
  "frontend/src/hooks/useAreaSelection.ts": "Manages area selection with persistence and optional geolocation to auto-select the closest Indian state.",
  "frontend/src/hooks/useAuthControls.ts": "Wraps Internet Identity auth with helpers for safe login, logout, and derived authentication state.",
  "frontend/src/hooks/useInternetIdentity.ts": "Provides React context and hooks for Internet Identity login, stored identity restoration, and auth state tracking.",
  "frontend/src/hooks/useModeration.ts": "Handles local muted/blocked user lists, persists them, and filters messages accordingly.",
  "frontend/src/hooks/useQueries.ts": "Provides React Query hooks for fetching rooms, messages, and performing mutations like creating rooms, sending messages, and user moderation actions using the actor API.",
  "frontend/src/hooks/useUserProfile.ts": "Manages user profile state, loading and saving backend profiles when authenticated or using a local anonymous profile otherwise, with auto-creation logic.",
  "frontend/src/index.css": "Defines Tailwind base styles and CSS variables for light/dark themes, plus a subtle background image and utility classes.",
  "frontend/src/main.tsx": "Bootstraps the React app, setting up React Query and the Internet Identity provider before rendering App.",
  "frontend/src/pages/ChatPage.tsx": "Displays a chat room with message polling, a message list, and a composer, including a header and room navigation.",
  "frontend/src/pages/LoginPage.tsx": "Renders the login UI with Internet Identity-based authentication and redirects after successful login.",
  "frontend/src/pages/RoomsPage.tsx": "Shows rooms filtered by area and search, supports room creation with authentication checks, and handles joining rooms.",
  "frontend/src/pages/SettingsPage.tsx": "React settings page handling area selection, location toggle, profile updates, and login/logout logic with various UI components and hooks.",
  "frontend/src/storage/anonProfileStorage.ts": "Generates, loads, and saves anonymous user profiles with random IDs, nicknames, colors, and avatars in localStorage.",
  "frontend/src/storage/areaSelectionStorage.ts": "Stores and retrieves area selection state, including a special 'All areas' option and available Indian states.",
  "frontend/src/utils/auth/isAuthError.ts": "Checks whether an error message matches common authentication or authorization failure patterns.",
  "frontend/src/utils/auth/postLoginRedirect.ts": "Manages storing and retrieving a redirect path in sessionStorage for after successful login.",
  "frontend/src/utils/location/closestIndianState.ts": "Uses Haversine distance to find the closest Indian state centroid to given coordinates.",
  "frontend/src/utils/urlParams.ts": "Utilities for reading URL parameters, persisting them in sessionStorage, and managing hash-based query parameters.",
  "frontend/tailwind.config.js": "Tailwind CSS configuration defining theme extensions, colors, animations, and plugins.",
  "project_state.json": "Project state metadata including features, requests, and configuration for the Rooms search restrictions project."
}