{
  "kind": "build_request",
  "title": "Retry deployment by fixing build errors and removing backend admin-role functionality",
  "priority": "normal",
  "requirements": [
    {
      "id": "REQ-1",
      "text": "Fix the project build/deployment failure so the app can successfully build and deploy (backend canister + frontend assets) without errors.",
      "target": "both",
      "source": {
        "messageIds": [
          "msg-7"
        ],
        "quotes": [
          "yess"
        ]
      },
      "acceptanceCriteria": [
        "A clean build completes successfully for both backend and frontend (no TypeScript/Vite errors; no Motoko compile errors).",
        "A deployment run completes successfully and results in a reachable frontend with the app shell rendering.",
        "Core flows load without runtime errors in the browser console: rooms list renders, entering a room renders chat, and sending a message works."
      ]
    },
    {
      "id": "REQ-2",
      "text": "Remove admin-role management and any admin-only moderation functionality from the Motoko backend canister API so the product no longer exposes admin controls via the canister interface.",
      "target": "backend",
      "source": {
        "messageIds": [
          "msg-7"
        ],
        "quotes": [
          "yess"
        ]
      },
      "acceptanceCriteria": [
        "The backend no longer depends on or exposes admin-role management constructs/endpoints (no admin elevation, admin password gates, or admin permission checks).",
        "All remaining backend endpoints used by the current frontend continue to function: create room, list rooms, send message, list messages, mute/block, report, and user profile CRUD.",
        "If backend state shape changes are required to remove admin-related state, a safe conditional migration is implemented in backend/migration.mo and upgrading preserves non-admin data (rooms, messages, mutes, blocks, reports, userProfiles, counters)."
      ]
    }
  ],
  "constraints": [
    "Backend must remain a single Motoko actor in backend/main.mo (no additional backend services).",
    "Do not edit files under frontend/src/components/ui or any paths listed as immutable in SYSTEM_CONTEXT.",
    "Use English for any user-facing text."
  ],
  "nonGoals": [
    "Adding new product features unrelated to resolving the build/deploy failure and removing admin functionality.",
    "Adding third-party authentication methods beyond Internet Identity.",
    "Introducing external databases or additional backend services."
  ],
  "imageRequirements": {
    "required": [],
    "edits": []
  }
}