{
  "kind": "implementation_plan",
  "version": "1.0",
  "title": "Fix frontend build errors and remove client-side admin-token initialization",
  "requirements": [
    {
      "id": "REQ-1",
      "summary": "Resolve frontend build/runtime failures by removing admin-token initialization and aligning frontend typings with the non-admin backend API so core chat flows work end-to-end.",
      "acceptanceCriteria": [
        "A clean build completes successfully for both backend and frontend (no TypeScript/Vite errors; no Motoko compile errors).",
        "A deployment run completes successfully and results in a reachable frontend with the app shell rendering.",
        "Core flows load without runtime errors in the browser console: rooms list renders, entering a room renders chat, and sending a message works."
      ],
      "file_operations": [
        {
          "path": "frontend/src/hooks/useActor.ts",
          "operation": "modify",
          "description": "Remove the admin-secret bootstrap call and any dependency on the secret URL parameter so the actor creation matches the non-admin backend API. Keep using the existing core infrastructure actor creation (`createActorWithConfig`) for authenticated/anonymous actors. Verify the component's usage instructions before implementing."
        },
        {
          "path": "frontend/src/backend.d.ts",
          "operation": "modify",
          "description": "Update the generated backend type declarations to no longer require or expose admin-role management methods (e.g., role assignment/admin checks) so TypeScript reflects the updated canister interface and builds cleanly."
        },
        {
          "path": "frontend/src/utils/urlParams.ts",
          "operation": "modify",
          "description": "Remove or neutralize admin-token-specific documentation/usage expectations (e.g., references to caffeine admin tokens) and ensure remaining helpers are still used safely by the app (no behavior change required beyond admin-token removal)."
        },
        {
          "path": "frontend/src/hooks/useAdminAccess.ts",
          "operation": "delete",
          "description": "Remove unused/placeholder admin hook file to avoid accidental future imports and keep the codebase aligned with the removal of admin functionality."
        },
        {
          "path": "frontend/src/hooks/useAdminManagement.ts",
          "operation": "delete",
          "description": "Remove unused/placeholder admin management hook file to avoid accidental future imports and keep the codebase aligned with the removal of admin functionality."
        },
        {
          "path": "frontend/src/components/admin/AdminPasswordAccessPrompt.tsx",
          "operation": "delete",
          "description": "Remove the unused/placeholder admin password prompt component so the frontend no longer contains admin-access UI artifacts."
        },
        {
          "path": "frontend/src/pages/AdminPage.tsx",
          "operation": "delete",
          "description": "Remove the unused/placeholder admin page so the frontend no longer contains admin-only navigation targets."
        }
      ]
    }
  ]
}