{
  "kind": "implementation_plan",
  "version": "1.0",
  "title": "Password-based admin unlock without Internet Identity requirement (frontend)",
  "requirements": [
    {
      "id": "REQ-2",
      "summary": "Use the same shared admin password constant for UI unlock, backend admin unlock call, and room deletion password validation UX.",
      "acceptanceCriteria": [
        "The password expected by the backend for admin unlocking and for deleteRoom(providedPassword) matches the password used by the frontend UI unlock flow (frontend/src/config/adminPassword.ts).",
        "Entering the correct password in the UI unlock flow enables admin operations and allows room deletion to succeed with the same password.",
        "Entering an incorrect password in either flow fails with an error indicating the password is incorrect."
      ],
      "file_operations": [
        {
          "path": "frontend/src/components/rooms/RoomDeleteWithPasswordDialog.tsx",
          "operation": "modify",
          "description": "Align room deletion UX with the shared UI admin password by validating the entered password against ADMIN_PASSWORD (from frontend/src/config/adminPassword.ts) before attempting deletion, and adjust helper/error text to clearly indicate the same password is used for admin unlock and room deletion. Verify the component's usage instructions before implementing."
        },
        {
          "path": "frontend/src/hooks/useAdminManagement.ts",
          "operation": "modify",
          "description": "Use ADMIN_PASSWORD (frontend/src/config/adminPassword.ts) as the single password source when invoking the backend admin-granting capability after the UI is unlocked, and ensure mismatch scenarios surface a clear 'password incorrect/mismatch' guidance to the user. Verify the component's usage instructions before implementing."
        },
        {
          "path": "frontend/src/backend.d.ts",
          "operation": "modify",
          "description": "Update the frontend backend interface typing to include the new backend admin-granting shared method that accepts the password and grants admin privileges for the caller (as required by REQ-1/REQ-2), so the frontend can call it from the unlock flow."
        }
      ]
    },
    {
      "id": "REQ-3",
      "summary": "Gate admin operations by both UI password unlock state and backend-confirmed admin status, without requiring Internet Identity login solely for admin access.",
      "acceptanceCriteria": [
        "The admin panel no longer blocks admin functionality with a \"Not authenticated\" requirement if the user has unlocked with the correct password and the backend confirms admin status.",
        "The frontend triggers the backend admin-granting flow upon successful password entry (so backend admin checks can pass).",
        "AdminModerationPanels actions are enabled when the password is correct and backend admin status is true, and remain disabled with clear messaging otherwise."
      ],
      "file_operations": [
        {
          "path": "frontend/src/hooks/useAdminManagement.ts",
          "operation": "modify",
          "description": "Refactor useAdminCapability to: (1) run backend admin checks for both authenticated and anonymous actors (remove the identity-only gating), (2) trigger the backend admin-granting method after successful UI unlock, and (3) provide clear reason/nextStep states for locked, granting-in-progress, grant-failed, and backend-not-admin outcomes. Verify the component's usage instructions before implementing."
        },
        {
          "path": "frontend/src/pages/AdminPage.tsx",
          "operation": "modify",
          "description": "Remove admin blocking based solely on Internet Identity authentication; rely on useAdminCapability for the effective admin status and display moderation UI availability accordingly (including showing a 'granting/verifying admin status' state after unlock). Verify the component's usage instructions before implementing."
        },
        {
          "path": "frontend/src/components/chat/MessageActionsMenu.tsx",
          "operation": "modify",
          "description": "Update the admin-only 'Delete Message (Admin)' visibility gating to require backend-confirmed admin capability (use useAdminCapability.canPerformAdminOps), not only the UI unlock flag, so delete attempts don't immediately fail with unauthorized traps. Verify the component's usage instructions before implementing."
        },
        {
          "path": "frontend/src/components/admin/AdminModerationPanels.tsx",
          "operation": "modify",
          "description": "Ensure panels and their disabled states/messages reflect the combined gating (UI unlock + backend-confirmed admin) and clearly communicate why actions are disabled when admin is not yet granted/verified. Verify the component's usage instructions before implementing."
        }
      ]
    },
    {
      "id": "REQ-4",
      "summary": "Update Admin page UX copy and alerts to reflect password-based admin access rather than requiring an admin Internet Identity account.",
      "acceptanceCriteria": [
        "AdminPage does not instruct users that they must log in with an \"admin Internet Identity account\" to perform admin operations.",
        "If admin operations are unavailable, the UI explains the actual next step (e.g., enter password, or password accepted but backend admin not yet granted/verified).",
        "All user-facing text is in English."
      ],
      "file_operations": [
        {
          "path": "frontend/src/pages/AdminPage.tsx",
          "operation": "modify",
          "description": "Update all admin-related UX copy to remove references to needing an 'admin Internet Identity account' and replace with password-based instructions and next steps (enter password; wait for backend verification; retry if backend rejects). Ensure alerts reflect the real state from useAdminCapability. Verify the component's usage instructions before implementing."
        },
        {
          "path": "frontend/src/hooks/useAdminManagement.ts",
          "operation": "modify",
          "description": "Adjust returned reason/nextStep strings to be accurate for password-based admin access (English only), including cases where the UI is unlocked but backend admin has not yet been granted/confirmed. Verify the component's usage instructions before implementing."
        },
        {
          "path": "frontend/src/components/admin/AdminPasswordAccessPrompt.tsx",
          "operation": "modify",
          "description": "Update prompt copy to match the new flow (password unlock triggers backend admin granting/verification) and ensure error text remains clear and English-only. Verify the component's usage instructions before implementing."
        }
      ]
    }
  ]
}